# WeatherStation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
City..::..WeatherStation Property
City Class See Also
---
An identifier for the nearest weather station
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string WeatherStation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WeatherStation As String
	Get
```

Visual C++
---
```text
public:
property String^ WeatherStation {
	String^ get ();
}
```

# Remarks
A read only string property that contains an identifier of the nearest weather station.
# See Also
City Class
Autodesk.Revit.DB Namespace